>>>>>>>> None%
19 12 32 11 17 15
========
[ 15 17 11 32 12 19 ]
<<<<<<<<

>>>>>>>> None%
15
========
[ 15 ]
<<<<<<<<

>>>>>>>> None%
15 12
========
[ 12 15 ]
<<<<<<<<

>>>>>>>> None%
15 17 11
========
[ 11 17 15 ]
<<<<<<<<
